# GetColorName

## Description
Retrieves the color name of the specified color index.

```pascal
FUNCTION GetColorName(ColorIndex : INTEGER) : STRING;
```

```python

def vs.GetColorName(ColorIndex):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ColorIndex|INTEGER|The index of the color|

## Returns
The name of the color specified by the index.

## See Also
VS Functions:
SetColorName

## Version
Availability: from Vectorworks 2011
## Category
* Object Names